


def answer_list():
    bot_answer = ['Какой хитрый ход!',
                'Вот это ты молодец!',
                'Xм, а тут надо подумать ;)',
                'Вау! У тебя есть все шансы на победу! ',
                'Давай старайся, я знаю, ты можешь хуже )']
    return bot_answer

def rul():
    rule =(f' Правила.\nКто последний заберет со стола конфеты, '
            f'тот и победил. Нельзя брать больше 28. Вышли мне одной строкой \n/set и число '
            f' \nгде число будет указывать сколько всего конфет на столе.'
            f' Иначе на столе будет 150 конфет и ты просто можешь выслать количество конфет, которое берешь.\n'
            f' :)'
            f'\nУдачи')
    return rule