


def answer_list():
    bot_answer = ['Какой хитрый ход!',
                'Вот это ты молодец!',
                'Xм, а тут надо подумать ;)',
                'Вау! У тебя есть все шансы на победу! ',
                'Давай старайся, я знаю, ты можешь хуже ))']
    return bot_answer

def rul():
    rule =(f' Правила.\n'
    f'Кто последний заберет со стола конфеты, тот и победил. Нельзя брать больше 28 шт. '
    f'\nКоманда:'
    f' \n/set и число '
    f' \nопределит изначальное количество конфет. '
    f' Иначе на столе будет 150 конфет и в дельнейшем просто шли мне число, указывающее сколько ты взял конфет(сладкоежочка).\n'
    f' Всё просто :))'
    f'\nУдачи')
    return rule